In [2]:
import pandas as pd

In [7]:
data = pd.Series([10,30,-6,9])
data

0    10
1    30
2    -6
3     9
dtype: int64

In [9]:
print(data.values)
print(data.index)

[10 30 -6  9]
RangeIndex(start=0, stop=4, step=1)

In [11]:
age = pd.Series([10,13,9,16], index = ['Bill','Alice','Carl','Dennis'])
age

Bill      10
Alice     13
Carl       9
Dennis    16
dtype: int64

In [12]:
age[1]

13

In [13]:
age['Alice']

13

In [14]:
age.shape

(4,)

In [70]:
##################################
DoL = {'name':['Bella','Charlie','Lucy'],
       'breed':['Labrador','Poodle','ChowChow'],
       'color':['Brown','Black','Brown'],
       'height_cm':[56,43,46],
       'weight_kg':[24,24,24],
       'date_of_birth':['2013-07-01','2016-09-16','2014-08-25']}

In [71]:
dogs = pd.DataFrame(DoL)

In [72]:
dogs

      name     breed  color  height_cm  weight_kg date_of_birth
0    Bella  Labrador  Brown         56         24    2013-07-01
1  Charlie    Poodle  Black         43         24    2016-09-16
2     Lucy  ChowChow  Brown         46         24    2014-08-25

In [25]:
print(dogs.values)
print(dogs.columns)
print(dogs.index)

RangeIndex(start=0, stop=3, step=1)

In [28]:
# read csv file in:
df = pd.read_csv(r"C:\Users\bilene\OneDrive - Dickinson College\Documents\GitHub\Data200_Spring23\data\gapminder.csv")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [30]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [32]:
dogs['name']

0      Bella
1    Charlie
2       Lucy
Name: name, dtype: object

In [33]:
dogs

      name     breed  color  height_cm  weight_kg date_of_birth
0    Bella  Labrador  Brown         56         24    2013-07-01
1  Charlie    Poodle  Black         43         24    2016-09-16
2     Lucy  ChowChow  Brown         46         24    2014-08-25

In [35]:
dogs.iloc[0]  # to access df content using index position

name                  Bella
breed              Labrador
color                 Brown
height_cm                56
weight_kg                24
date_of_birth    2013-07-01
Name: 0, dtype: object

In [37]:
dogs

      name     breed  color  height_cm  weight_kg date_of_birth
0    Bella  Labrador  Brown         56         24    2013-07-01
1  Charlie    Poodle  Black         43         24    2016-09-16
2     Lucy  ChowChow  Brown         46         24    2014-08-25

In [56]:
# create rownames which consist of dog names
dogs.index = dogs['name']

In [57]:
dogs.drop(columns=['name'], inplace=True) # drop duplicate column

In [58]:
dogs

            breed  color  height_cm  weight_kg date_of_birth
name
Bella    Labrador  Brown         56         24    2013-07-01
Charlie    Poodle  Black         43         24    2016-09-16
Lucy     ChowChow  Brown         46         24    2014-08-25

In [60]:
dogs.loc['Bella'] # access using rowlabel info

breed              Labrador
color                 Brown
height_cm                56
weight_kg                24
date_of_birth    2013-07-01
Name: Bella, dtype: object

In [62]:
dogs.loc['Bella'][['breed','color']] # possible to combine filter and select

breed    Labrador
color       Brown
Name: Bella, dtype: object

In [63]:
dogs = dogs.reset_index(drop=False) # reset index, row labels will be stored
# as a column with drop=False option by default
dogs

      name     breed  color  height_cm  weight_kg date_of_birth
0    Bella  Labrador  Brown         56         24    2013-07-01
1  Charlie    Poodle  Black         43         24    2016-09-16
2     Lucy  ChowChow  Brown         46         24    2014-08-25

In [64]:
dogs[['name','breed']] # subset columns

      name     breed
0    Bella  Labrador
1  Charlie    Poodle
2     Lucy  ChowChow

In [65]:
dogs[dogs['height_cm']>50] # return dogs with height > 50 cm

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01

In [73]:
dogs = dogs[dogs['color']=="Brown"].reset_index(drop=True) #returns dogs 
# with brown color, resets index
dogs

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01
1   Lucy  ChowChow  Brown         46         24    2014-08-25

In [77]:
dogs[dogs['date_of_birth'] > "2014-01-01"]

   name     breed  color  height_cm  weight_kg date_of_birth
1  Lucy  ChowChow  Brown         46         24    2014-08-25

In [78]:
dogs

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01
1   Lucy  ChowChow  Brown         46         24    2014-08-25

In [79]:
import datetime as dt
dt.date.today()

datetime.date(2023, 2, 21)

In [80]:
# create a new column named todays_date
dogs['todays_date'] = dt.date.today()
dogs

    name     breed  color  height_cm  weight_kg date_of_birth todays_date
0  Bella  Labrador  Brown         56         24    2013-07-01  2023-02-21
1   Lucy  ChowChow  Brown         46         24    2014-08-25  2023-02-21

In [91]:
# define both columns as datetime columns, get age in year
(pd.to_datetime(dogs['todays_date']) - pd.to_datetime(dogs['date_of_birth']))\
    .dt.days/365

0    9.649315
1    8.498630
dtype: float64